src/test/resources/soap/simple-soap-response.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <car xmlns="webtest::vehicles::cars">
            <wheel>front-left</wheel>
            <prices>
                <price>5</price>
                <price>654</price>
                <price>4325</price>
            </prices>
        </car>
    </soap:Body>
</soap:Envelope>